{
"Type":["a building in a merchant district",
	"attached to the merchant's home",
	"a wagon pulled by a horse or ox team",
	"under a tent",
	"in an open bazaar on a rug",
	"in a stall in a bazaar",
	"in the back room of another shop",
	"a merchant caravan",
	"in a place only accessibly by magic",
	"a franchise. The shop can be found in multiple places"],
	
"Condition":["pristine. Kept in the best possible condition",
	"cleaned regularly",
	"mixed. Some items look new, while some look like they have been there a long time",
	"organized but dusty",
	"falling apart",
	"ancient", 
	"brand new. Everything has a place, and is in its place",
	"well maintained. It is cleaned regularly",
	"average. A little dusty",
	"unkempt. Bugs and rodents scurry away from your footsteps",
	"dark. There is no natural light. Only a candle or two light the shop",
	"decrepit. The building should be condemned"],
	
"Busy":["It's one of the most popular places to visit",
	"A few people mill in and out of the shop",
	"Not very busy. You are the only people there",
	"It rarely sees a customer"],
	
"Tidbit":["The shopkeeper lives in a room attached to the shop",
	"There is a secret room in the back to sell illicit wares",
	"The shopkeeper does not seem to belong there",
	"One of the items does not seem to belong there",
	"A bell rings every time someone enters the shop",
	"The shopkeeper is unusually friendly",
	"The shopkeeper does not seem to want any business",
	"Some items are oddly magical (or non-magical)",
	"You feel an unseen presence watching you",
	"Magical barriers prevent people from handling the merchandise",
	"A goblin is handling some of the wares",
	"A ogre is leashed to one of the walls",
	"A couple dogs keep an eye on you, while chewing on a bone",
	"A cat follows you around the shop",
	"A goat seems to be keeping guard outside the shop",
	"A rats nest is forming in a secluded corner",
	"A talking bird insists on yelling obscenities at you",
	"Many items are being packed for sale",
	"A new shipment has just arrived, and is being stocked",
	"You hear noises from the roof or room above the shop",
	"The floor is cracked",
	"The merchant is cleaning up an item that was ruined on the shop floor",
	"The shopkeeper is arguing with an employee",
	"A monkey follows you and tries to hand merchandise to you",
	"Footprints lead directly into a wall",
	"A raven tries to steal items from your bag",
	"The merchant's young children are trying unsuccessfully at a hard sale",
	"The merchant does not speak common",
	"Items change when you're not looking",
	"Music is playing throughout the shop",
	"The merchant can tell a story behind everything he sells",
	"Some of the items appear stolen",
	"The shop is only open at night",
	"The shop is closed for the day",
	"An unusual item is for sale with a dark backstory",
	"A couple of thugs are holding up the merchant",
	"One of the customers is trying to shoplift",
	"The shop has a strong odor of mildew",
	"The shop is owned by a friend or former party member",
	"A ghost is browsing the merchandise",
	"The shopkeeper is fast asleep",
	"The shopkeeper has a pungent and offensive smell",
	"The shopkeeper is a forceful salesman",
	"A legendary weapon is on display, but not for sale",
	"Murals line the walls",
	"The merchant insists he is from an ancient line of powerful merchants",
	"The merchant dresses much better than expected",
	"The merchant looks like a beggar",
	"Constables or the local guard are interviewing everyone in the shop",
	"The shopkeeper just died"]
}