{
"Busy":["It's one of the most popular places to visit",
	"A few people mill in and out of the shop",
	"Not very busy. You are the only people there",
	"It rarely sees a customer"],
	
"Appearance":["The shop is located in a creaky old wooden building that is slowly learning to one side. As you approach, the edifice actually moans",
"A brightly colored tent hangs over the front of the shop, with some wares showing outside",
"The shop is located in a merchant caravan. The wares hidden inside a wagon",
"The shop is an open bazaar on a rug.",
"The shop is located down a set of suspicious stairs, in the basement level of another building",
"The shop is located in an immaculate stone building. You can see the many wares through it's windows",
"The shop is a simple wooden shack, with a small hedged yard",
"The shop is a single storey timber and brick building, with a heather-thatched roof",
"The shop is a two-storey timber and brick building, with a tiled mosaic floor. It appears to have once been a manor.",
"The shop is a stone-walled building, with a red tile roof. It is exceptionally clean, and well lit by an iron chandelier."
"A sign leads you up a set of stairs to the second story of a building, where the shop is located.",
"The shop is in an extravagant timber building with a dragon motif.",
"The shop is located in a sturdy looking stone structure. A grass lawn leads up to the double doors."],

	
"Tidbit":["The shopkeeper lives in a room attached to the shop",
	"There is a secret room in the back to sell illicit wares",
	"One of the shopkeeper's arms are broken, and currently healing in a sling.",
	"One of the items does not seem to belong there",
	"A bell rings every time someone enters the shop",
	"The shopkeeper does not seem to want any business",
	"Some items are oddly magical (or non-magical)",
	"Magical barriers prevent people from handling the merchandise",
	"A goblin is handling some of the wares",
	"A ogre is leashed to one of the walls",
	"A couple dogs keep an eye on you, while chewing on a bone",
	"A cat follows you around the shop",
	"A goat seems to be keeping guard outside the shop",
	"A talking bird insists on yelling obscenities at you",
	"Many items are being packed for sale",
	"A new shipment has just arrived, and is being stocked",
	"You hear noises from the roof or room above the shop",
	"The floor is cracked",
	"The merchant is cleaning up an item that was ruined on the shop floor",
	"The shopkeeper is arguing with an employee",
	"A monkey follows you and tries to hand merchandise to you",
	"Footprints lead directly into a wall",
	"A raven tries to steal items from your bag",
	"The merchant's young children are trying unsuccessfully at a hard sale",
	"The merchant does not speak common",
	"Items change when you're not looking",
	"Music is playing throughout the shop",
	"The merchant can tell a story behind everything he sells",
	"Some of the items appear stolen",
	"The shop is only open at night",
	"The shop is closed for the day",
	"An unusual item is for sale with a dark backstory",
	"A couple of thugs are holding up the merchant",
	"One of the customers is trying to shoplift",
	"The shop has a strong odor of mildew",
	"The shop is owned by a friend or former party member",
	"A ghost is browsing the merchandise",
	"The shopkeeper is fast asleep",
	"The shopkeeper has a pungent and offensive smell",
	"The shopkeeper is a forceful salesman",
	"A legendary weapon is on display, but not for sale",
	"Murals line the walls",
	"The merchant insists he is from an ancient line of powerful merchants",
	"The merchant dresses much better than expected",
	"The merchant looks like a beggar",
	"Constables or the local guard are interviewing everyone in the shop",
	"The previous shopkeeper has just died",	
	"In the corner, a bard sings a sad tale. All the shop patrons one by one join in, singing along",
	"The shop is pristine. Kept in the best possible condition",
	"The shop is cleaned regularly",
	"Some items look new, while some look like they have been there a long time",
	"The wares are organized but dusty",
	"The building is falling apart",
	"This shop appears ancient", 
	"The shop appears brand new. Everything has a place, and is in its place",
	"You notice that the shop is well maintained. It is cleaned regularly",
	"The shop's is a little dusty, but otherwise well kept.",
	"As you walk in, bugs and rodents scurry away from your footsteps",
	"There is no natural light. Only a candle or two light the shop",
	"The building should be condemned. The shop is decrepid",
	"The shop smells strongly of incense and jasmine",
	"Some items are displayed in glass cases",
	"The door creaks wearily as you open it",
	"Opening the door, a light bell rings. The shopkeep rapidly hides a book under the countertop",
	"The hearth is decorated with a large and grotesque skull of unknown origin"]
}